latency-results/html_report_20251026_225145/statistics.json
{
  "Query All Certificates" : {
    "transaction" : "Query All Certificates",
    "sampleCount" : 2000,
    "errorCount" : 2000,
    "errorPct" : 100.0,
    "meanResTime" : 5.000000000000025E-4,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 15.915583743822765,
    "receivedKBytesPerSec" : 18.30913833029611,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2650,
    "errorCount" : 2650,
    "errorPct" : 100.0,
    "meanResTime" : 3.7735849056604005E-4,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 20.29655954168071,
    "receivedKBytesPerSec" : 23.34448407485984,
    "sentKBytesPerSec" : 0.0
  },
  "Purchase Certificate" : {
    "transaction" : "Purchase Certificate",
    "sampleCount" : 150,
    "errorCount" : 150,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 1.1909487892020643,
    "receivedKBytesPerSec" : 1.3654041782453354,
    "sentKBytesPerSec" : 0.0
  },
  "Create REC Certificate" : {
    "transaction" : "Create REC Certificate",
    "sampleCount" : 500,
    "errorCount" : 500,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 3.861242393352485,
    "receivedKBytesPerSec" : 4.4419370501652615,
    "sentKBytesPerSec" : 0.0
  }
}