latency-results/jmeter_20251026_225017.log
2025-10-26 22:50:18,702 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-10-26 22:50:18,731 INFO o.a.j.JMeter: Loading user properties from: /home/najla/Downloads/apache-jmeter-5.6.3/bin/user.properties
2025-10-26 22:50:18,732 INFO o.a.j.JMeter: Loading system properties from: /home/najla/Downloads/apache-jmeter-5.6.3/bin/system.properties
2025-10-26 22:50:18,737 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-10-26 22:50:18,738 INFO o.a.j.JMeter: Version 5.6.3
2025-10-26 22:50:18,738 INFO o.a.j.JMeter: java.version=11.0.28
2025-10-26 22:50:18,738 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2025-10-26 22:50:18,738 INFO o.a.j.JMeter: os.name=Linux
2025-10-26 22:50:18,738 INFO o.a.j.JMeter: os.arch=amd64
2025-10-26 22:50:18,738 INFO o.a.j.JMeter: os.version=6.14.0-32-generic
2025-10-26 22:50:18,738 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-10-26 22:50:18,738 INFO o.a.j.JMeter: java.awt.headless=true
2025-10-26 22:50:18,738 INFO o.a.j.JMeter: Max memory     =1073741824
2025-10-26 22:50:18,738 INFO o.a.j.JMeter: Available Processors =22
2025-10-26 22:50:18,746 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-10-26 22:50:18,746 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-10-26 22:50:18,746 INFO o.a.j.JMeter: JMeterHome=/home/najla/Downloads/apache-jmeter-5.6.3
2025-10-26 22:50:18,746 INFO o.a.j.JMeter: user.dir  =/home/najla/Downloads/REC-Blockchain
2025-10-26 22:50:18,746 INFO o.a.j.JMeter: PWD       =/home/najla/Downloads/REC-Blockchain
2025-10-26 22:50:18,747 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: najla FullName: najla
2025-10-26 22:50:18,759 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'/home/najla/Downloads/REC-Blockchain/latency-results/html_report_20251026_225017'
2025-10-26 22:50:18,762 INFO o.a.j.s.FileServer: Default base='/home/najla/Downloads/REC-Blockchain'
2025-10-26 22:50:18,763 INFO o.a.j.s.FileServer: Set new base='/home/najla/Downloads/REC-Blockchain'
2025-10-26 22:50:18,974 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-10-26 22:50:18,996 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-10-26 22:50:19,000 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-10-26 22:50:19,003 INFO o.a.j.s.SaveService: Loading file: /home/najla/Downloads/REC-Blockchain/jmeter-latency-test.jmx
2025-10-26 22:50:19,068 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-10-26 22:50:19,068 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-10-26 22:50:19,069 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-10-26 22:50:19,069 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-10-26 22:50:19,069 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-10-26 22:50:19,069 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-10-26 22:50:19,116 INFO o.a.j.JMeter: Creating summariser <summary>
2025-10-26 22:50:19,121 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2025-10-26 22:50:19,122 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: /home/najla/Downloads/REC-Blockchain/latency-results/latency_results_20251026_225017.jtl
2025-10-26 22:50:19,122 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: /home/najla/Downloads/apache-jmeter-5.6.3/bin/reportgenerator.properties
2025-10-26 22:50:19,122 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2025-10-26 22:50:19,126 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2025-10-26 22:50:19,129 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2025-10-26 22:50:19,129 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction is empty, not APDEX per transaction customization
2025-10-26 22:50:19,129 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2025-10-26 22:50:19,129 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2025-10-26 22:50:19,129 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2025-10-26 22:50:19,129 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2025-10-26 22:50:19,129 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2025-10-26 22:50:19,130 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2025-10-26 22:50:19,134 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2025-10-26 22:50:19,134 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2025-10-26 22:50:19,134 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2025-10-26 22:50:19,135 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2025-10-26 22:50:19,135 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2025-10-26 22:50:19,135 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2025-10-26 22:50:19,135 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2025-10-26 22:50:19,135 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2025-10-26 22:50:19,136 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2025-10-26 22:50:19,136 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2025-10-26 22:50:19,137 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2025-10-26 22:50:19,137 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2025-10-26 22:50:19,137 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2025-10-26 22:50:19,137 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2025-10-26 22:50:19,138 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2025-10-26 22:50:19,138 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2025-10-26 22:50:19,151 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-10-26 22:50:19,152 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-10-26 22:50:19,152 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-10-26 22:50:19,162 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-10-26 22:50:19,163 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-10-26 22:50:19,460 INFO o.a.j.JMeter: Running test (1761493819460)
2025-10-26 22:50:19,480 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : REC Certificate Creation
2025-10-26 22:50:19,481 INFO o.a.j.e.StandardJMeterEngine: Starting 10 threads for group REC Certificate Creation.
2025-10-26 22:50:19,481 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-10-26 22:50:19,481 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=10 ramp-up=30 delayedStart=false
2025-10-26 22:50:19,495 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Creation 1-1
2025-10-26 22:50:19,501 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-10-26 22:50:19,501 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 2 : REC Certificate Query
2025-10-26 22:50:19,501 INFO o.a.j.e.StandardJMeterEngine: Starting 20 threads for group REC Certificate Query.
2025-10-26 22:50:19,501 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-10-26 22:50:19,501 INFO o.a.j.t.ThreadGroup: Starting thread group... number=2 threads=20 ramp-up=30 delayedStart=false
2025-10-26 22:50:19,502 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Query 2-1
2025-10-26 22:50:19,509 INFO o.a.j.t.ThreadGroup: Started thread group number 2
2025-10-26 22:50:19,509 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 3 : Purchase Transaction
2025-10-26 22:50:19,509 INFO o.a.j.e.StandardJMeterEngine: Starting 5 threads for group Purchase Transaction.
2025-10-26 22:50:19,509 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-10-26 22:50:19,509 INFO o.a.j.t.ThreadGroup: Starting thread group... number=3 threads=5 ramp-up=20 delayedStart=false
2025-10-26 22:50:19,510 INFO o.a.j.t.JMeterThread: Thread started: Purchase Transaction 3-1
2025-10-26 22:50:19,512 INFO o.a.j.t.ThreadGroup: Started thread group number 3
2025-10-26 22:50:19,512 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-10-26 22:50:20,089 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = najla
2025-10-26 22:50:20,097 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-10-26 22:50:20,099 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-10-26 22:50:20,099 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-10-26 22:50:20,099 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-10-26 22:50:20,099 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-10-26 22:50:21,003 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Query 2-2
2025-10-26 22:50:22,490 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Creation 1-2
2025-10-26 22:50:22,502 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Query 2-3
2025-10-26 22:50:23,510 INFO o.a.j.t.JMeterThread: Thread started: Purchase Transaction 3-2
2025-10-26 22:50:24,002 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Query 2-4
2025-10-26 22:50:25,486 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Creation 1-3
2025-10-26 22:50:25,504 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Query 2-5
2025-10-26 22:50:27,002 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Query 2-6
2025-10-26 22:50:27,509 INFO o.a.j.t.JMeterThread: Thread started: Purchase Transaction 3-3
2025-10-26 22:50:28,486 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Creation 1-4
2025-10-26 22:50:28,503 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Query 2-7
2025-10-26 22:50:30,004 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Query 2-8
2025-10-26 22:50:30,042 INFO o.a.j.r.Summariser: summary +     51 in 00:00:11 =    4.8/s Avg:     0 Min:     0 Max:     0 Err:    51 (100.00%) Active: 15 Started: 15 Finished: 0
2025-10-26 22:50:31,482 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Creation 1-5
2025-10-26 22:50:31,502 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Query 2-9
2025-10-26 22:50:31,510 INFO o.a.j.t.JMeterThread: Thread started: Purchase Transaction 3-4
2025-10-26 22:50:33,003 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Query 2-10
2025-10-26 22:50:34,482 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Creation 1-6
2025-10-26 22:50:34,502 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Query 2-11
2025-10-26 22:50:35,511 INFO o.a.j.t.JMeterThread: Thread started: Purchase Transaction 3-5
2025-10-26 22:50:36,003 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Query 2-12
2025-10-26 22:50:37,481 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Creation 1-7
2025-10-26 22:50:37,502 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Query 2-13
2025-10-26 22:50:39,003 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Query 2-14
2025-10-26 22:50:40,482 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Creation 1-8
2025-10-26 22:50:40,503 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Query 2-15
2025-10-26 22:50:42,002 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Query 2-16
2025-10-26 22:50:43,483 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Creation 1-9
2025-10-26 22:50:43,503 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Query 2-17
2025-10-26 22:50:45,002 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Query 2-18
2025-10-26 22:50:46,485 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Creation 1-10
2025-10-26 22:50:46,503 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Query 2-19
2025-10-26 22:50:48,004 INFO o.a.j.t.JMeterThread: Thread started: REC Certificate Query 2-20
2025-10-26 22:51:00,009 INFO o.a.j.r.Summariser: summary +    638 in 00:00:30 =   21.3/s Avg:     0 Min:     0 Max:     0 Err:   638 (100.00%) Active: 35 Started: 35 Finished: 0
2025-10-26 22:51:00,010 INFO o.a.j.r.Summariser: summary =    689 in 00:00:41 =   17.0/s Avg:     0 Min:     0 Max:     0 Err:   689 (100.00%)
2025-10-26 22:51:13,163 INFO o.a.j.r.ResultCollector: Shutdown hook started
2025-10-26 22:51:13,165 INFO o.a.j.r.ResultCollector: Shutdown hook ended